# 4. Напишите программу, которая будет преобразовывать десятичное число в двоичное (без встроенных функций).
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10


#s = ""
#n = int(input("Введите число в десятичной системе счисления: "))
#while n != 0:
#    s = str(n%2) + s
#    n //=2
#print(f'Число в двоичной системе после преобразования: {s}')

